#App constants
#Ранги в игре
RANKS = (
        ('UN', 'Без ранга'),
        ('S1', 'Сильвер 1'),
        ('S2', 'Сильвер 2'),
        ('S3', 'Сильвер 3'),
        ('S4', 'Сильвер 4'),
        ('S5', 'Сильвер Элита'),
        ('S6', 'Сильвер Великий Магистр'),
        ('N1', 'Золотая Звезда 1'),
        ('N2', 'Золотая Звезда 2'),
        ('N3', 'Золотая Звезда 3'),
        ('N4', 'Золотая Звезда Магистр'),
        ('M1', 'Магистр Хранитель 1'),
        ('M2', 'Магистр Хранитель 2'),
        ('M3', 'Магистр Хранитель Элита'),
        ('M4', 'Заслуженный Магистр Хранитель'),
        ('L1', 'Легендарный Беркут'),
        ('L2', 'Легендарный Беркут Магистр'),
        ('SM', 'Великий Магистр Высшего Ранга'),
        ('GE', 'Всемирная Элита'),
    )
#Типы игр
TYPES = {
        'MM': 'Соревновательный',
        'PU': 'Игры в лигах',
        'LE': 'Профессиональная Лига',
        'CA': 'Казуальный',
}
#Типы игроков
GAMERS = {
    'AWP':'Авапер',
    'LUK':'Люрк',
    'RIF':'Рифлер',
    'IGL':'Капитан',
    'SUP':'Саппорт',
    'FRG':'Фрагер',
    }